avrdudes/avr-libc/include/avr/ioavr64da64s.h
/* Channel 2 generator select bit group values */
typedef enum EVSYS_CHANNEL2_VALUES_enum
{
    EVSYS_CHANNEL2_OFF_gv          = 0x00,  /* Off */
    EVSYS_CHANNEL2_UPDI_SYNCH_gv   = 0x01,  /* UPDI SYNCH character */
    EVSYS_CHANNEL2_RTC_OVF_gv      = 0x06,  /* Real Time Counter overflow */
    EVSYS_CHANNEL2_RTC_CMP_gv      = 0x07,  /* Real Time Counter compare */
    EVSYS_CHANNEL2_RTC_PIT_DIV8192_gv = 0x08,  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL2_RTC_PIT_DIV4096_gv = 0x09,  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL2_RTC_PIT_DIV2048_gv = 0x0A,  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL2_RTC_PIT_DIV1024_gv = 0x0B,  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL2_CCL_LUT0_gv     = 0x10,  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL2_CCL_LUT1_gv     = 0x11,  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL2_CCL_LUT2_gv     = 0x12,  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL2_CCL_LUT3_gv     = 0x13,  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL2_CCL_LUT4_gv     = 0x14,  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL2_CCL_LUT5_gv     = 0x15,  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL2_AC0_OUT_gv      = 0x20,  /* Analog Comparator 0 out */
    EVSYS_CHANNEL2_AC1_OUT_gv      = 0x21,  /* Analog Comparator 1 out */
    EVSYS_CHANNEL2_AC2_OUT_gv      = 0x22,  /* Analog Comparator 2 out */
    EVSYS_CHANNEL2_ADC0_RESRDY_gv  = 0x24,  /* ADC 0 Result Ready */
    EVSYS_CHANNEL2_PTC_RESRDY_gv   = 0x28,  /* PTC Result Ready */
    EVSYS_CHANNEL2_ZCD0_gv         = 0x30,  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL2_ZCD1_gv         = 0x31,  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL2_ZCD2_gv         = 0x32,  /* Zero Cross Detect 2 out */
    EVSYS_CHANNEL2_PORTC_PIN0_gv   = 0x40,  /* Port C Pin 0 */
    EVSYS_CHANNEL2_PORTC_PIN1_gv   = 0x41,  /* Port C Pin 1 */
    EVSYS_CHANNEL2_PORTC_PIN2_gv   = 0x42,  /* Port C Pin 2 */
    EVSYS_CHANNEL2_PORTC_PIN3_gv   = 0x43,  /* Port C Pin 3 */
    EVSYS_CHANNEL2_PORTC_PIN4_gv   = 0x44,  /* Port C Pin 4 */
    EVSYS_CHANNEL2_PORTC_PIN5_gv   = 0x45,  /* Port C Pin 5 */
    EVSYS_CHANNEL2_PORTC_PIN6_gv   = 0x46,  /* Port C Pin 6 */
    EVSYS_CHANNEL2_PORTC_PIN7_gv   = 0x47,  /* Port C Pin 7 */
    EVSYS_CHANNEL2_PORTD_PIN0_gv   = 0x48,  /* Port D Pin 0 */
    EVSYS_CHANNEL2_PORTD_PIN1_gv   = 0x49,  /* Port D Pin 1 */
    EVSYS_CHANNEL2_PORTD_PIN2_gv   = 0x4A,  /* Port D Pin 2 */
    EVSYS_CHANNEL2_PORTD_PIN3_gv   = 0x4B,  /* Port D Pin 3 */
    EVSYS_CHANNEL2_PORTD_PIN4_gv   = 0x4C,  /* Port D Pin 4 */
    EVSYS_CHANNEL2_PORTD_PIN5_gv   = 0x4D,  /* Port D Pin 5 */
    EVSYS_CHANNEL2_PORTD_PIN6_gv   = 0x4E,  /* Port D Pin 6 */
    EVSYS_CHANNEL2_PORTD_PIN7_gv   = 0x4F,  /* Port D Pin 7 */
    EVSYS_CHANNEL2_USART0_XCK_gv   = 0x60,  /* USART 0 XCK */
    EVSYS_CHANNEL2_USART1_XCK_gv   = 0x61,  /* USART 1 XCK */
    EVSYS_CHANNEL2_USART2_XCK_gv   = 0x62,  /* USART 2 XCK */
    EVSYS_CHANNEL2_USART3_XCK_gv   = 0x63,  /* USART 3 XCK */
    EVSYS_CHANNEL2_USART4_XCK_gv   = 0x64,  /* USART 4 XCK */
    EVSYS_CHANNEL2_USART5_XCK_gv   = 0x65,  /* USART 5 XCK */
    EVSYS_CHANNEL2_SPI0_SCK_gv     = 0x68,  /* SPI 0 SCK */
    EVSYS_CHANNEL2_SPI1_SCK_gv     = 0x69,  /* SPI 1 SCK */
    EVSYS_CHANNEL2_TCA0_OVF_LUNF_gv = 0x80,  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL2_TCA0_HUNF_gv    = 0x81,  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL2_TCA0_CMP0_LCMP0_gv = 0x84,  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL2_TCA0_CMP1_LCMP1_gv = 0x85,  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL2_TCA0_CMP2_LCMP2_gv = 0x86,  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL2_TCA1_OVF_LUNF_gv = 0x88,  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL2_TCA1_HUNF_gv    = 0x89,  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL2_TCA1_CMP0_LCMP0_gv = 0x8C,  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL2_TCA1_CMP1_LCMP1_gv = 0x8D,  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL2_TCA1_CMP2_LCMP2_gv = 0x8E,  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL2_TCB0_CAPT_gv    = 0xA0,  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL2_TCB0_OVF_gv     = 0xA1,  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL2_TCB1_CAPT_gv    = 0xA2,  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL2_TCB1_OVF_gv     = 0xA3,  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL2_TCB2_CAPT_gv    = 0xA4,  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL2_TCB2_OVF_gv     = 0xA5,  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL2_TCB3_CAPT_gv    = 0xA6,  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL2_TCB3_OVF_gv     = 0xA7,  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL2_TCB4_CAPT_gv    = 0xA8,  /* Timer/Counter B4 capture */
    EVSYS_CHANNEL2_TCB4_OVF_gv     = 0xA9,  /* Timer/Counter B4 overflow */
    EVSYS_CHANNEL2_TCD0_CMPBCLR_gv = 0xB0,  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL2_TCD0_CMPASET_gv = 0xB1,  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL2_TCD0_CMPBSET_gv = 0xB2,  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL2_TCD0_PROGEV_gv  = 0xB3   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL2_values_t;

/* Channel 2 generator select bit group configurations*/
typedef enum EVSYS_CHANNEL2_enum
{
    EVSYS_CHANNEL2_OFF_gc          = (EVSYS_CHANNEL2_OFF_gv << EVSYS_CHANNEL2_gp),  /* Off */
    EVSYS_CHANNEL2_UPDI_SYNCH_gc   = (EVSYS_CHANNEL2_UPDI_SYNCH_gv << EVSYS_CHANNEL2_gp),  /* UPDI SYNCH character */
    EVSYS_CHANNEL2_RTC_OVF_gc      = (EVSYS_CHANNEL2_RTC_OVF_gv << EVSYS_CHANNEL2_gp),  /* Real Time Counter overflow */
    EVSYS_CHANNEL2_RTC_CMP_gc      = (EVSYS_CHANNEL2_RTC_CMP_gv << EVSYS_CHANNEL2_gp),  /* Real Time Counter compare */
    EVSYS_CHANNEL2_RTC_PIT_DIV8192_gc = (EVSYS_CHANNEL2_RTC_PIT_DIV8192_gv << EVSYS_CHANNEL2_gp),  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL2_RTC_PIT_DIV4096_gc = (EVSYS_CHANNEL2_RTC_PIT_DIV4096_gv << EVSYS_CHANNEL2_gp),  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL2_RTC_PIT_DIV2048_gc = (EVSYS_CHANNEL2_RTC_PIT_DIV2048_gv << EVSYS_CHANNEL2_gp),  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL2_RTC_PIT_DIV1024_gc = (EVSYS_CHANNEL2_RTC_PIT_DIV1024_gv << EVSYS_CHANNEL2_gp),  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL2_CCL_LUT0_gc     = (EVSYS_CHANNEL2_CCL_LUT0_gv << EVSYS_CHANNEL2_gp),  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL2_CCL_LUT1_gc     = (EVSYS_CHANNEL2_CCL_LUT1_gv << EVSYS_CHANNEL2_gp),  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL2_CCL_LUT2_gc     = (EVSYS_CHANNEL2_CCL_LUT2_gv << EVSYS_CHANNEL2_gp),  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL2_CCL_LUT3_gc     = (EVSYS_CHANNEL2_CCL_LUT3_gv << EVSYS_CHANNEL2_gp),  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL2_CCL_LUT4_gc     = (EVSYS_CHANNEL2_CCL_LUT4_gv << EVSYS_CHANNEL2_gp),  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL2_CCL_LUT5_gc     = (EVSYS_CHANNEL2_CCL_LUT5_gv << EVSYS_CHANNEL2_gp),  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL2_AC0_OUT_gc      = (EVSYS_CHANNEL2_AC0_OUT_gv << EVSYS_CHANNEL2_gp),  /* Analog Comparator 0 out */
    EVSYS_CHANNEL2_AC1_OUT_gc      = (EVSYS_CHANNEL2_AC1_OUT_gv << EVSYS_CHANNEL2_gp),  /* Analog Comparator 1 out */
    EVSYS_CHANNEL2_AC2_OUT_gc      = (EVSYS_CHANNEL2_AC2_OUT_gv << EVSYS_CHANNEL2_gp),  /* Analog Comparator 2 out */
    EVSYS_CHANNEL2_ADC0_RESRDY_gc  = (EVSYS_CHANNEL2_ADC0_RESRDY_gv << EVSYS_CHANNEL2_gp),  /* ADC 0 Result Ready */
    EVSYS_CHANNEL2_PTC_RESRDY_gc   = (EVSYS_CHANNEL2_PTC_RESRDY_gv << EVSYS_CHANNEL2_gp),  /* PTC Result Ready */
    EVSYS_CHANNEL2_ZCD0_gc         = (EVSYS_CHANNEL2_ZCD0_gv << EVSYS_CHANNEL2_gp),  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL2_ZCD1_gc         = (EVSYS_CHANNEL2_ZCD1_gv << EVSYS_CHANNEL2_gp),  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL2_ZCD2_gc         = (EVSYS_CHANNEL2_ZCD2_gv << EVSYS_CHANNEL2_gp),  /* Zero Cross Detect 2 out */
    EVSYS_CHANNEL2_PORTC_PIN0_gc   = (EVSYS_CHANNEL2_PORTC_PIN0_gv << EVSYS_CHANNEL2_gp),  /* Port C Pin 0 */
    EVSYS_CHANNEL2_PORTC_PIN1_gc   = (EVSYS_CHANNEL2_PORTC_PIN1_gv << EVSYS_CHANNEL2_gp),  /* Port C Pin 1 */
    EVSYS_CHANNEL2_PORTC_PIN2_gc   = (EVSYS_CHANNEL2_PORTC_PIN2_gv << EVSYS_CHANNEL2_gp),  /* Port C Pin 2 */
    EVSYS_CHANNEL2_PORTC_PIN3_gc   = (EVSYS_CHANNEL2_PORTC_PIN3_gv << EVSYS_CHANNEL2_gp),  /* Port C Pin 3 */
    EVSYS_CHANNEL2_PORTC_PIN4_gc   = (EVSYS_CHANNEL2_PORTC_PIN4_gv << EVSYS_CHANNEL2_gp),  /* Port C Pin 4 */
    EVSYS_CHANNEL2_PORTC_PIN5_gc   = (EVSYS_CHANNEL2_PORTC_PIN5_gv << EVSYS_CHANNEL2_gp),  /* Port C Pin 5 */
    EVSYS_CHANNEL2_PORTC_PIN6_gc   = (EVSYS_CHANNEL2_PORTC_PIN6_gv << EVSYS_CHANNEL2_gp),  /* Port C Pin 6 */
    EVSYS_CHANNEL2_PORTC_PIN7_gc   = (EVSYS_CHANNEL2_PORTC_PIN7_gv << EVSYS_CHANNEL2_gp),  /* Port C Pin 7 */
    EVSYS_CHANNEL2_PORTD_PIN0_gc   = (EVSYS_CHANNEL2_PORTD_PIN0_gv << EVSYS_CHANNEL2_gp),  /* Port D Pin 0 */
    EVSYS_CHANNEL2_PORTD_PIN1_gc   = (EVSYS_CHANNEL2_PORTD_PIN1_gv << EVSYS_CHANNEL2_gp),  /* Port D Pin 1 */
    EVSYS_CHANNEL2_PORTD_PIN2_gc   = (EVSYS_CHANNEL2_PORTD_PIN2_gv << EVSYS_CHANNEL2_gp),  /* Port D Pin 2 */
    EVSYS_CHANNEL2_PORTD_PIN3_gc   = (EVSYS_CHANNEL2_PORTD_PIN3_gv << EVSYS_CHANNEL2_gp),  /* Port D Pin 3 */
    EVSYS_CHANNEL2_PORTD_PIN4_gc   = (EVSYS_CHANNEL2_PORTD_PIN4_gv << EVSYS_CHANNEL2_gp),  /* Port D Pin 4 */
    EVSYS_CHANNEL2_PORTD_PIN5_gc   = (EVSYS_CHANNEL2_PORTD_PIN5_gv << EVSYS_CHANNEL2_gp),  /* Port D Pin 5 */
    EVSYS_CHANNEL2_PORTD_PIN6_gc   = (EVSYS_CHANNEL2_PORTD_PIN6_gv << EVSYS_CHANNEL2_gp),  /* Port D Pin 6 */
    EVSYS_CHANNEL2_PORTD_PIN7_gc   = (EVSYS_CHANNEL2_PORTD_PIN7_gv << EVSYS_CHANNEL2_gp),  /* Port D Pin 7 */
    EVSYS_CHANNEL2_USART0_XCK_gc   = (EVSYS_CHANNEL2_USART0_XCK_gv << EVSYS_CHANNEL2_gp),  /* USART 0 XCK */
    EVSYS_CHANNEL2_USART1_XCK_gc   = (EVSYS_CHANNEL2_USART1_XCK_gv << EVSYS_CHANNEL2_gp),  /* USART 1 XCK */
    EVSYS_CHANNEL2_USART2_XCK_gc   = (EVSYS_CHANNEL2_USART2_XCK_gv << EVSYS_CHANNEL2_gp),  /* USART 2 XCK */
    EVSYS_CHANNEL2_USART3_XCK_gc   = (EVSYS_CHANNEL2_USART3_XCK_gv << EVSYS_CHANNEL2_gp),  /* USART 3 XCK */
    EVSYS_CHANNEL2_USART4_XCK_gc   = (EVSYS_CHANNEL2_USART4_XCK_gv << EVSYS_CHANNEL2_gp),  /* USART 4 XCK */
    EVSYS_CHANNEL2_USART5_XCK_gc   = (EVSYS_CHANNEL2_USART5_XCK_gv << EVSYS_CHANNEL2_gp),  /* USART 5 XCK */
    EVSYS_CHANNEL2_SPI0_SCK_gc     = (EVSYS_CHANNEL2_SPI0_SCK_gv << EVSYS_CHANNEL2_gp),  /* SPI 0 SCK */
    EVSYS_CHANNEL2_SPI1_SCK_gc     = (EVSYS_CHANNEL2_SPI1_SCK_gv << EVSYS_CHANNEL2_gp),  /* SPI 1 SCK */
    EVSYS_CHANNEL2_TCA0_OVF_LUNF_gc = (EVSYS_CHANNEL2_TCA0_OVF_LUNF_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL2_TCA0_HUNF_gc    = (EVSYS_CHANNEL2_TCA0_HUNF_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL2_TCA0_CMP0_LCMP0_gc = (EVSYS_CHANNEL2_TCA0_CMP0_LCMP0_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL2_TCA0_CMP1_LCMP1_gc = (EVSYS_CHANNEL2_TCA0_CMP1_LCMP1_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL2_TCA0_CMP2_LCMP2_gc = (EVSYS_CHANNEL2_TCA0_CMP2_LCMP2_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL2_TCA1_OVF_LUNF_gc = (EVSYS_CHANNEL2_TCA1_OVF_LUNF_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL2_TCA1_HUNF_gc    = (EVSYS_CHANNEL2_TCA1_HUNF_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL2_TCA1_CMP0_LCMP0_gc = (EVSYS_CHANNEL2_TCA1_CMP0_LCMP0_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL2_TCA1_CMP1_LCMP1_gc = (EVSYS_CHANNEL2_TCA1_CMP1_LCMP1_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL2_TCA1_CMP2_LCMP2_gc = (EVSYS_CHANNEL2_TCA1_CMP2_LCMP2_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL2_TCB0_CAPT_gc    = (EVSYS_CHANNEL2_TCB0_CAPT_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL2_TCB0_OVF_gc     = (EVSYS_CHANNEL2_TCB0_OVF_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL2_TCB1_CAPT_gc    = (EVSYS_CHANNEL2_TCB1_CAPT_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL2_TCB1_OVF_gc     = (EVSYS_CHANNEL2_TCB1_OVF_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL2_TCB2_CAPT_gc    = (EVSYS_CHANNEL2_TCB2_CAPT_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL2_TCB2_OVF_gc     = (EVSYS_CHANNEL2_TCB2_OVF_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL2_TCB3_CAPT_gc    = (EVSYS_CHANNEL2_TCB3_CAPT_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL2_TCB3_OVF_gc     = (EVSYS_CHANNEL2_TCB3_OVF_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL2_TCB4_CAPT_gc    = (EVSYS_CHANNEL2_TCB4_CAPT_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter B4 capture */
    EVSYS_CHANNEL2_TCB4_OVF_gc     = (EVSYS_CHANNEL2_TCB4_OVF_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter B4 overflow */
    EVSYS_CHANNEL2_TCD0_CMPBCLR_gc = (EVSYS_CHANNEL2_TCD0_CMPBCLR_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL2_TCD0_CMPASET_gc = (EVSYS_CHANNEL2_TCD0_CMPASET_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL2_TCD0_CMPBSET_gc = (EVSYS_CHANNEL2_TCD0_CMPBSET_gv << EVSYS_CHANNEL2_gp),  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL2_TCD0_PROGEV_gc  = (EVSYS_CHANNEL2_TCD0_PROGEV_gv << EVSYS_CHANNEL2_gp)   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL2_t;

/* Channel 3 generator select bit group values */
typedef enum EVSYS_CHANNEL3_VALUES_enum
{
    EVSYS_CHANNEL3_OFF_gv          = 0x00,  /* Off */
    EVSYS_CHANNEL3_UPDI_SYNCH_gv   = 0x01,  /* UPDI SYNCH character */
    EVSYS_CHANNEL3_RTC_OVF_gv      = 0x06,  /* Real Time Counter overflow */
    EVSYS_CHANNEL3_RTC_CMP_gv      = 0x07,  /* Real Time Counter compare */
    EVSYS_CHANNEL3_RTC_PIT_DIV512_gv = 0x08,  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL3_RTC_PIT_DIV256_gv = 0x09,  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL3_RTC_PIT_DIV128_gv = 0x0A,  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL3_RTC_PIT_DIV64_gv = 0x0B,  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL3_CCL_LUT0_gv     = 0x10,  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL3_CCL_LUT1_gv     = 0x11,  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL3_CCL_LUT2_gv     = 0x12,  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL3_CCL_LUT3_gv     = 0x13,  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL3_CCL_LUT4_gv     = 0x14,  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL3_CCL_LUT5_gv     = 0x15,  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL3_AC0_OUT_gv      = 0x20,  /* Analog Comparator 0 out */
    EVSYS_CHANNEL3_AC1_OUT_gv      = 0x21,  /* Analog Comparator 1 out */
    EVSYS_CHANNEL3_AC2_OUT_gv      = 0x22,  /* Analog Comparator 2 out */
    EVSYS_CHANNEL3_ADC0_RESRDY_gv  = 0x24,  /* ADC 0 Result Ready */
    EVSYS_CHANNEL3_PTC_RESRDY_gv   = 0x28,  /* PTC Result Ready */
    EVSYS_CHANNEL3_ZCD0_gv         = 0x30,  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL3_ZCD1_gv         = 0x31,  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL3_ZCD2_gv         = 0x32,  /* Zero Cross Detect 2 out */
    EVSYS_CHANNEL3_PORTC_PIN0_gv   = 0x40,  /* Port C Pin 0 */
    EVSYS_CHANNEL3_PORTC_PIN1_gv   = 0x41,  /* Port C Pin 1 */
    EVSYS_CHANNEL3_PORTC_PIN2_gv   = 0x42,  /* Port C Pin 2 */
    EVSYS_CHANNEL3_PORTC_PIN3_gv   = 0x43,  /* Port C Pin 3 */
    EVSYS_CHANNEL3_PORTC_PIN4_gv   = 0x44,  /* Port C Pin 4 */
    EVSYS_CHANNEL3_PORTC_PIN5_gv   = 0x45,  /* Port C Pin 5 */
    EVSYS_CHANNEL3_PORTC_PIN6_gv   = 0x46,  /* Port C Pin 6 */
    EVSYS_CHANNEL3_PORTC_PIN7_gv   = 0x47,  /* Port C Pin 7 */
    EVSYS_CHANNEL3_PORTD_PIN0_gv   = 0x48,  /* Port D Pin 0 */
    EVSYS_CHANNEL3_PORTD_PIN1_gv   = 0x49,  /* Port D Pin 1 */
    EVSYS_CHANNEL3_PORTD_PIN2_gv   = 0x4A,  /* Port D Pin 2 */
    EVSYS_CHANNEL3_PORTD_PIN3_gv   = 0x4B,  /* Port D Pin 3 */
    EVSYS_CHANNEL3_PORTD_PIN4_gv   = 0x4C,  /* Port D Pin 4 */
    EVSYS_CHANNEL3_PORTD_PIN5_gv   = 0x4D,  /* Port D Pin 5 */
    EVSYS_CHANNEL3_PORTD_PIN6_gv   = 0x4E,  /* Port D Pin 6 */
    EVSYS_CHANNEL3_PORTD_PIN7_gv   = 0x4F,  /* Port D Pin 7 */
    EVSYS_CHANNEL3_USART0_XCK_gv   = 0x60,  /* USART 0 XCK */
    EVSYS_CHANNEL3_USART1_XCK_gv   = 0x61,  /* USART 1 XCK */
    EVSYS_CHANNEL3_USART2_XCK_gv   = 0x62,  /* USART 2 XCK */
    EVSYS_CHANNEL3_USART3_XCK_gv   = 0x63,  /* USART 3 XCK */
    EVSYS_CHANNEL3_USART4_XCK_gv   = 0x64,  /* USART 4 XCK */
    EVSYS_CHANNEL3_USART5_XCK_gv   = 0x65,  /* USART 5 XCK */
    EVSYS_CHANNEL3_SPI0_SCK_gv     = 0x68,  /* SPI 0 SCK */
    EVSYS_CHANNEL3_SPI1_SCK_gv     = 0x69,  /* SPI 1 SCK */
    EVSYS_CHANNEL3_TCA0_OVF_LUNF_gv = 0x80,  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL3_TCA0_HUNF_gv    = 0x81,  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL3_TCA0_CMP0_LCMP0_gv = 0x84,  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL3_TCA0_CMP1_LCMP1_gv = 0x85,  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL3_TCA0_CMP2_LCMP2_gv = 0x86,  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL3_TCA1_OVF_LUNF_gv = 0x88,  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL3_TCA1_HUNF_gv    = 0x89,  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL3_TCA1_CMP0_LCMP0_gv = 0x8C,  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL3_TCA1_CMP1_LCMP1_gv = 0x8D,  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL3_TCA1_CMP2_LCMP2_gv = 0x8E,  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL3_TCB0_CAPT_gv    = 0xA0,  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL3_TCB0_OVF_gv     = 0xA1,  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL3_TCB1_CAPT_gv    = 0xA2,  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL3_TCB1_OVF_gv     = 0xA3,  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL3_TCB2_CAPT_gv    = 0xA4,  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL3_TCB2_OVF_gv     = 0xA5,  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL3_TCB3_CAPT_gv    = 0xA6,  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL3_TCB3_OVF_gv     = 0xA7,  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL3_TCB4_CAPT_gv    = 0xA8,  /* Timer/Counter B4 capture */
    EVSYS_CHANNEL3_TCB4_OVF_gv     = 0xA9,  /* Timer/Counter B4 overflow */
    EVSYS_CHANNEL3_TCD0_CMPBCLR_gv = 0xB0,  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL3_TCD0_CMPASET_gv = 0xB1,  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL3_TCD0_CMPBSET_gv = 0xB2,  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL3_TCD0_PROGEV_gv  = 0xB3   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL3_values_t;

