avrdudes/avr-libc/include/avr/ioavr64da64s.h
/* Channel 8 generator select bit group values */
typedef enum EVSYS_CHANNEL8_VALUES_enum
{
    EVSYS_CHANNEL8_OFF_gv          = 0x00,  /* Off */
    EVSYS_CHANNEL8_UPDI_SYNCH_gv   = 0x01,  /* UPDI SYNCH character */
    EVSYS_CHANNEL8_RTC_OVF_gv      = 0x06,  /* Real Time Counter overflow */
    EVSYS_CHANNEL8_RTC_CMP_gv      = 0x07,  /* Real Time Counter compare */
    EVSYS_CHANNEL8_RTC_PIT_DIV8192_gv = 0x08,  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL8_RTC_PIT_DIV4096_gv = 0x09,  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL8_RTC_PIT_DIV2048_gv = 0x0A,  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL8_RTC_PIT_DIV1024_gv = 0x0B,  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL8_CCL_LUT0_gv     = 0x10,  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL8_CCL_LUT1_gv     = 0x11,  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL8_CCL_LUT2_gv     = 0x12,  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL8_CCL_LUT3_gv     = 0x13,  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL8_CCL_LUT4_gv     = 0x14,  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL8_CCL_LUT5_gv     = 0x15,  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL8_AC0_OUT_gv      = 0x20,  /* Analog Comparator 0 out */
    EVSYS_CHANNEL8_AC1_OUT_gv      = 0x21,  /* Analog Comparator 1 out */
    EVSYS_CHANNEL8_AC2_OUT_gv      = 0x22,  /* Analog Comparator 2 out */
    EVSYS_CHANNEL8_ADC0_RESRDY_gv  = 0x24,  /* ADC 0 Result Ready */
    EVSYS_CHANNEL8_PTC_RESRDY_gv   = 0x28,  /* PTC Result Ready */
    EVSYS_CHANNEL8_ZCD0_gv         = 0x30,  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL8_ZCD1_gv         = 0x31,  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL8_ZCD2_gv         = 0x32,  /* Zero Cross Detect 2 out */
    EVSYS_CHANNEL8_USART0_XCK_gv   = 0x60,  /* USART 0 XCK */
    EVSYS_CHANNEL8_USART1_XCK_gv   = 0x61,  /* USART 1 XCK */
    EVSYS_CHANNEL8_USART2_XCK_gv   = 0x62,  /* USART 2 XCK */
    EVSYS_CHANNEL8_USART3_XCK_gv   = 0x63,  /* USART 3 XCK */
    EVSYS_CHANNEL8_USART4_XCK_gv   = 0x64,  /* USART 4 XCK */
    EVSYS_CHANNEL8_USART5_XCK_gv   = 0x65,  /* USART 5 XCK */
    EVSYS_CHANNEL8_SPI0_SCK_gv     = 0x68,  /* SPI 0 SCK */
    EVSYS_CHANNEL8_SPI1_SCK_gv     = 0x69,  /* SPI 1 SCK */
    EVSYS_CHANNEL8_TCA0_OVF_LUNF_gv = 0x80,  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL8_TCA0_HUNF_gv    = 0x81,  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL8_TCA0_CMP0_LCMP0_gv = 0x84,  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL8_TCA0_CMP1_LCMP1_gv = 0x85,  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL8_TCA0_CMP2_LCMP2_gv = 0x86,  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL8_TCA1_OVF_LUNF_gv = 0x88,  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL8_TCA1_HUNF_gv    = 0x89,  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL8_TCA1_CMP0_LCMP0_gv = 0x8C,  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL8_TCA1_CMP1_LCMP1_gv = 0x8D,  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL8_TCA1_CMP2_LCMP2_gv = 0x8E,  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL8_TCB0_CAPT_gv    = 0xA0,  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL8_TCB0_OVF_gv     = 0xA1,  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL8_TCB1_CAPT_gv    = 0xA2,  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL8_TCB1_OVF_gv     = 0xA3,  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL8_TCB2_CAPT_gv    = 0xA4,  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL8_TCB2_OVF_gv     = 0xA5,  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL8_TCB3_CAPT_gv    = 0xA6,  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL8_TCB3_OVF_gv     = 0xA7,  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL8_TCB4_CAPT_gv    = 0xA8,  /* Timer/Counter B4 capture */
    EVSYS_CHANNEL8_TCB4_OVF_gv     = 0xA9,  /* Timer/Counter B4 overflow */
    EVSYS_CHANNEL8_TCD0_CMPBCLR_gv = 0xB0,  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL8_TCD0_CMPASET_gv = 0xB1,  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL8_TCD0_CMPBSET_gv = 0xB2,  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL8_TCD0_PROGEV_gv  = 0xB3   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL8_values_t;

/* Channel 8 generator select bit group configurations*/
typedef enum EVSYS_CHANNEL8_enum
{
    EVSYS_CHANNEL8_OFF_gc          = (EVSYS_CHANNEL8_OFF_gv << EVSYS_CHANNEL8_gp),  /* Off */
    EVSYS_CHANNEL8_UPDI_SYNCH_gc   = (EVSYS_CHANNEL8_UPDI_SYNCH_gv << EVSYS_CHANNEL8_gp),  /* UPDI SYNCH character */
    EVSYS_CHANNEL8_RTC_OVF_gc      = (EVSYS_CHANNEL8_RTC_OVF_gv << EVSYS_CHANNEL8_gp),  /* Real Time Counter overflow */
    EVSYS_CHANNEL8_RTC_CMP_gc      = (EVSYS_CHANNEL8_RTC_CMP_gv << EVSYS_CHANNEL8_gp),  /* Real Time Counter compare */
    EVSYS_CHANNEL8_RTC_PIT_DIV8192_gc = (EVSYS_CHANNEL8_RTC_PIT_DIV8192_gv << EVSYS_CHANNEL8_gp),  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL8_RTC_PIT_DIV4096_gc = (EVSYS_CHANNEL8_RTC_PIT_DIV4096_gv << EVSYS_CHANNEL8_gp),  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL8_RTC_PIT_DIV2048_gc = (EVSYS_CHANNEL8_RTC_PIT_DIV2048_gv << EVSYS_CHANNEL8_gp),  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL8_RTC_PIT_DIV1024_gc = (EVSYS_CHANNEL8_RTC_PIT_DIV1024_gv << EVSYS_CHANNEL8_gp),  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL8_CCL_LUT0_gc     = (EVSYS_CHANNEL8_CCL_LUT0_gv << EVSYS_CHANNEL8_gp),  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL8_CCL_LUT1_gc     = (EVSYS_CHANNEL8_CCL_LUT1_gv << EVSYS_CHANNEL8_gp),  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL8_CCL_LUT2_gc     = (EVSYS_CHANNEL8_CCL_LUT2_gv << EVSYS_CHANNEL8_gp),  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL8_CCL_LUT3_gc     = (EVSYS_CHANNEL8_CCL_LUT3_gv << EVSYS_CHANNEL8_gp),  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL8_CCL_LUT4_gc     = (EVSYS_CHANNEL8_CCL_LUT4_gv << EVSYS_CHANNEL8_gp),  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL8_CCL_LUT5_gc     = (EVSYS_CHANNEL8_CCL_LUT5_gv << EVSYS_CHANNEL8_gp),  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL8_AC0_OUT_gc      = (EVSYS_CHANNEL8_AC0_OUT_gv << EVSYS_CHANNEL8_gp),  /* Analog Comparator 0 out */
    EVSYS_CHANNEL8_AC1_OUT_gc      = (EVSYS_CHANNEL8_AC1_OUT_gv << EVSYS_CHANNEL8_gp),  /* Analog Comparator 1 out */
    EVSYS_CHANNEL8_AC2_OUT_gc      = (EVSYS_CHANNEL8_AC2_OUT_gv << EVSYS_CHANNEL8_gp),  /* Analog Comparator 2 out */
    EVSYS_CHANNEL8_ADC0_RESRDY_gc  = (EVSYS_CHANNEL8_ADC0_RESRDY_gv << EVSYS_CHANNEL8_gp),  /* ADC 0 Result Ready */
    EVSYS_CHANNEL8_PTC_RESRDY_gc   = (EVSYS_CHANNEL8_PTC_RESRDY_gv << EVSYS_CHANNEL8_gp),  /* PTC Result Ready */
    EVSYS_CHANNEL8_ZCD0_gc         = (EVSYS_CHANNEL8_ZCD0_gv << EVSYS_CHANNEL8_gp),  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL8_ZCD1_gc         = (EVSYS_CHANNEL8_ZCD1_gv << EVSYS_CHANNEL8_gp),  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL8_ZCD2_gc         = (EVSYS_CHANNEL8_ZCD2_gv << EVSYS_CHANNEL8_gp),  /* Zero Cross Detect 2 out */
    EVSYS_CHANNEL8_USART0_XCK_gc   = (EVSYS_CHANNEL8_USART0_XCK_gv << EVSYS_CHANNEL8_gp),  /* USART 0 XCK */
    EVSYS_CHANNEL8_USART1_XCK_gc   = (EVSYS_CHANNEL8_USART1_XCK_gv << EVSYS_CHANNEL8_gp),  /* USART 1 XCK */
    EVSYS_CHANNEL8_USART2_XCK_gc   = (EVSYS_CHANNEL8_USART2_XCK_gv << EVSYS_CHANNEL8_gp),  /* USART 2 XCK */
    EVSYS_CHANNEL8_USART3_XCK_gc   = (EVSYS_CHANNEL8_USART3_XCK_gv << EVSYS_CHANNEL8_gp),  /* USART 3 XCK */
    EVSYS_CHANNEL8_USART4_XCK_gc   = (EVSYS_CHANNEL8_USART4_XCK_gv << EVSYS_CHANNEL8_gp),  /* USART 4 XCK */
    EVSYS_CHANNEL8_USART5_XCK_gc   = (EVSYS_CHANNEL8_USART5_XCK_gv << EVSYS_CHANNEL8_gp),  /* USART 5 XCK */
    EVSYS_CHANNEL8_SPI0_SCK_gc     = (EVSYS_CHANNEL8_SPI0_SCK_gv << EVSYS_CHANNEL8_gp),  /* SPI 0 SCK */
    EVSYS_CHANNEL8_SPI1_SCK_gc     = (EVSYS_CHANNEL8_SPI1_SCK_gv << EVSYS_CHANNEL8_gp),  /* SPI 1 SCK */
    EVSYS_CHANNEL8_TCA0_OVF_LUNF_gc = (EVSYS_CHANNEL8_TCA0_OVF_LUNF_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL8_TCA0_HUNF_gc    = (EVSYS_CHANNEL8_TCA0_HUNF_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL8_TCA0_CMP0_LCMP0_gc = (EVSYS_CHANNEL8_TCA0_CMP0_LCMP0_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL8_TCA0_CMP1_LCMP1_gc = (EVSYS_CHANNEL8_TCA0_CMP1_LCMP1_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL8_TCA0_CMP2_LCMP2_gc = (EVSYS_CHANNEL8_TCA0_CMP2_LCMP2_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL8_TCA1_OVF_LUNF_gc = (EVSYS_CHANNEL8_TCA1_OVF_LUNF_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL8_TCA1_HUNF_gc    = (EVSYS_CHANNEL8_TCA1_HUNF_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL8_TCA1_CMP0_LCMP0_gc = (EVSYS_CHANNEL8_TCA1_CMP0_LCMP0_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL8_TCA1_CMP1_LCMP1_gc = (EVSYS_CHANNEL8_TCA1_CMP1_LCMP1_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL8_TCA1_CMP2_LCMP2_gc = (EVSYS_CHANNEL8_TCA1_CMP2_LCMP2_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL8_TCB0_CAPT_gc    = (EVSYS_CHANNEL8_TCB0_CAPT_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL8_TCB0_OVF_gc     = (EVSYS_CHANNEL8_TCB0_OVF_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL8_TCB1_CAPT_gc    = (EVSYS_CHANNEL8_TCB1_CAPT_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL8_TCB1_OVF_gc     = (EVSYS_CHANNEL8_TCB1_OVF_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL8_TCB2_CAPT_gc    = (EVSYS_CHANNEL8_TCB2_CAPT_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL8_TCB2_OVF_gc     = (EVSYS_CHANNEL8_TCB2_OVF_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL8_TCB3_CAPT_gc    = (EVSYS_CHANNEL8_TCB3_CAPT_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL8_TCB3_OVF_gc     = (EVSYS_CHANNEL8_TCB3_OVF_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL8_TCB4_CAPT_gc    = (EVSYS_CHANNEL8_TCB4_CAPT_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter B4 capture */
    EVSYS_CHANNEL8_TCB4_OVF_gc     = (EVSYS_CHANNEL8_TCB4_OVF_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter B4 overflow */
    EVSYS_CHANNEL8_TCD0_CMPBCLR_gc = (EVSYS_CHANNEL8_TCD0_CMPBCLR_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL8_TCD0_CMPASET_gc = (EVSYS_CHANNEL8_TCD0_CMPASET_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL8_TCD0_CMPBSET_gc = (EVSYS_CHANNEL8_TCD0_CMPBSET_gv << EVSYS_CHANNEL8_gp),  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL8_TCD0_PROGEV_gc  = (EVSYS_CHANNEL8_TCD0_PROGEV_gv << EVSYS_CHANNEL8_gp)   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL8_t;

/* Channel 9 generator select bit group values */
typedef enum EVSYS_CHANNEL9_VALUES_enum
{
    EVSYS_CHANNEL9_OFF_gv          = 0x00,  /* Off */
    EVSYS_CHANNEL9_UPDI_SYNCH_gv   = 0x01,  /* UPDI SYNCH character */
    EVSYS_CHANNEL9_RTC_OVF_gv      = 0x06,  /* Real Time Counter overflow */
    EVSYS_CHANNEL9_RTC_CMP_gv      = 0x07,  /* Real Time Counter compare */
    EVSYS_CHANNEL9_RTC_PIT_DIV512_gv = 0x08,  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL9_RTC_PIT_DIV256_gv = 0x09,  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL9_RTC_PIT_DIV128_gv = 0x0A,  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL9_RTC_PIT_DIV64_gv = 0x0B,  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL9_CCL_LUT0_gv     = 0x10,  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL9_CCL_LUT1_gv     = 0x11,  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL9_CCL_LUT2_gv     = 0x12,  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL9_CCL_LUT3_gv     = 0x13,  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL9_CCL_LUT4_gv     = 0x14,  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL9_CCL_LUT5_gv     = 0x15,  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL9_AC0_OUT_gv      = 0x20,  /* Analog Comparator 0 out */
    EVSYS_CHANNEL9_AC1_OUT_gv      = 0x21,  /* Analog Comparator 1 out */
    EVSYS_CHANNEL9_AC2_OUT_gv      = 0x22,  /* Analog Comparator 2 out */
    EVSYS_CHANNEL9_ADC0_RESRDY_gv  = 0x24,  /* ADC 0 Result Ready */
    EVSYS_CHANNEL9_PTC_RESRDY_gv   = 0x28,  /* PTC Result Ready */
    EVSYS_CHANNEL9_ZCD0_gv         = 0x30,  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL9_ZCD1_gv         = 0x31,  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL9_ZCD2_gv         = 0x32,  /* Zero Cross Detect 2 out */
    EVSYS_CHANNEL9_USART0_XCK_gv   = 0x60,  /* USART 0 XCK */
    EVSYS_CHANNEL9_USART1_XCK_gv   = 0x61,  /* USART 1 XCK */
    EVSYS_CHANNEL9_USART2_XCK_gv   = 0x62,  /* USART 2 XCK */
    EVSYS_CHANNEL9_USART3_XCK_gv   = 0x63,  /* USART 3 XCK */
    EVSYS_CHANNEL9_USART4_XCK_gv   = 0x64,  /* USART 4 XCK */
    EVSYS_CHANNEL9_USART5_XCK_gv   = 0x65,  /* USART 5 XCK */
    EVSYS_CHANNEL9_SPI0_SCK_gv     = 0x68,  /* SPI 0 SCK */
    EVSYS_CHANNEL9_SPI1_SCK_gv     = 0x69,  /* SPI 1 SCK */
    EVSYS_CHANNEL9_TCA0_OVF_LUNF_gv = 0x80,  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL9_TCA0_HUNF_gv    = 0x81,  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL9_TCA0_CMP0_LCMP0_gv = 0x84,  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL9_TCA0_CMP1_LCMP1_gv = 0x85,  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL9_TCA0_CMP2_LCMP2_gv = 0x86,  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL9_TCA1_OVF_LUNF_gv = 0x88,  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL9_TCA1_HUNF_gv    = 0x89,  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL9_TCA1_CMP0_LCMP0_gv = 0x8C,  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL9_TCA1_CMP1_LCMP1_gv = 0x8D,  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL9_TCA1_CMP2_LCMP2_gv = 0x8E,  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL9_TCB0_CAPT_gv    = 0xA0,  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL9_TCB0_OVF_gv     = 0xA1,  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL9_TCB1_CAPT_gv    = 0xA2,  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL9_TCB1_OVF_gv     = 0xA3,  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL9_TCB2_CAPT_gv    = 0xA4,  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL9_TCB2_OVF_gv     = 0xA5,  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL9_TCB3_CAPT_gv    = 0xA6,  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL9_TCB3_OVF_gv     = 0xA7,  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL9_TCB4_CAPT_gv    = 0xA8,  /* Timer/Counter B4 capture */
    EVSYS_CHANNEL9_TCB4_OVF_gv     = 0xA9,  /* Timer/Counter B4 overflow */
    EVSYS_CHANNEL9_TCD0_CMPBCLR_gv = 0xB0,  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL9_TCD0_CMPASET_gv = 0xB1,  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL9_TCD0_CMPBSET_gv = 0xB2,  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL9_TCD0_PROGEV_gv  = 0xB3   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL9_values_t;

/* Channel 9 generator select bit group configurations*/
typedef enum EVSYS_CHANNEL9_enum
{
    EVSYS_CHANNEL9_OFF_gc          = (EVSYS_CHANNEL9_OFF_gv << EVSYS_CHANNEL9_gp),  /* Off */
    EVSYS_CHANNEL9_UPDI_SYNCH_gc   = (EVSYS_CHANNEL9_UPDI_SYNCH_gv << EVSYS_CHANNEL9_gp),  /* UPDI SYNCH character */
    EVSYS_CHANNEL9_RTC_OVF_gc      = (EVSYS_CHANNEL9_RTC_OVF_gv << EVSYS_CHANNEL9_gp),  /* Real Time Counter overflow */
    EVSYS_CHANNEL9_RTC_CMP_gc      = (EVSYS_CHANNEL9_RTC_CMP_gv << EVSYS_CHANNEL9_gp),  /* Real Time Counter compare */
    EVSYS_CHANNEL9_RTC_PIT_DIV512_gc = (EVSYS_CHANNEL9_RTC_PIT_DIV512_gv << EVSYS_CHANNEL9_gp),  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL9_RTC_PIT_DIV256_gc = (EVSYS_CHANNEL9_RTC_PIT_DIV256_gv << EVSYS_CHANNEL9_gp),  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL9_RTC_PIT_DIV128_gc = (EVSYS_CHANNEL9_RTC_PIT_DIV128_gv << EVSYS_CHANNEL9_gp),  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL9_RTC_PIT_DIV64_gc = (EVSYS_CHANNEL9_RTC_PIT_DIV64_gv << EVSYS_CHANNEL9_gp),  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL9_CCL_LUT0_gc     = (EVSYS_CHANNEL9_CCL_LUT0_gv << EVSYS_CHANNEL9_gp),  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL9_CCL_LUT1_gc     = (EVSYS_CHANNEL9_CCL_LUT1_gv << EVSYS_CHANNEL9_gp),  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL9_CCL_LUT2_gc     = (EVSYS_CHANNEL9_CCL_LUT2_gv << EVSYS_CHANNEL9_gp),  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL9_CCL_LUT3_gc     = (EVSYS_CHANNEL9_CCL_LUT3_gv << EVSYS_CHANNEL9_gp),  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL9_CCL_LUT4_gc     = (EVSYS_CHANNEL9_CCL_LUT4_gv << EVSYS_CHANNEL9_gp),  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL9_CCL_LUT5_gc     = (EVSYS_CHANNEL9_CCL_LUT5_gv << EVSYS_CHANNEL9_gp),  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL9_AC0_OUT_gc      = (EVSYS_CHANNEL9_AC0_OUT_gv << EVSYS_CHANNEL9_gp),  /* Analog Comparator 0 out */
    EVSYS_CHANNEL9_AC1_OUT_gc      = (EVSYS_CHANNEL9_AC1_OUT_gv << EVSYS_CHANNEL9_gp),  /* Analog Comparator 1 out */
    EVSYS_CHANNEL9_AC2_OUT_gc      = (EVSYS_CHANNEL9_AC2_OUT_gv << EVSYS_CHANNEL9_gp),  /* Analog Comparator 2 out */
    EVSYS_CHANNEL9_ADC0_RESRDY_gc  = (EVSYS_CHANNEL9_ADC0_RESRDY_gv << EVSYS_CHANNEL9_gp),  /* ADC 0 Result Ready */
    EVSYS_CHANNEL9_PTC_RESRDY_gc   = (EVSYS_CHANNEL9_PTC_RESRDY_gv << EVSYS_CHANNEL9_gp),  /* PTC Result Ready */
    EVSYS_CHANNEL9_ZCD0_gc         = (EVSYS_CHANNEL9_ZCD0_gv << EVSYS_CHANNEL9_gp),  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL9_ZCD1_gc         = (EVSYS_CHANNEL9_ZCD1_gv << EVSYS_CHANNEL9_gp),  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL9_ZCD2_gc         = (EVSYS_CHANNEL9_ZCD2_gv << EVSYS_CHANNEL9_gp),  /* Zero Cross Detect 2 out */
    EVSYS_CHANNEL9_USART0_XCK_gc   = (EVSYS_CHANNEL9_USART0_XCK_gv << EVSYS_CHANNEL9_gp),  /* USART 0 XCK */
    EVSYS_CHANNEL9_USART1_XCK_gc   = (EVSYS_CHANNEL9_USART1_XCK_gv << EVSYS_CHANNEL9_gp),  /* USART 1 XCK */
    EVSYS_CHANNEL9_USART2_XCK_gc   = (EVSYS_CHANNEL9_USART2_XCK_gv << EVSYS_CHANNEL9_gp),  /* USART 2 XCK */
    EVSYS_CHANNEL9_USART3_XCK_gc   = (EVSYS_CHANNEL9_USART3_XCK_gv << EVSYS_CHANNEL9_gp),  /* USART 3 XCK */
    EVSYS_CHANNEL9_USART4_XCK_gc   = (EVSYS_CHANNEL9_USART4_XCK_gv << EVSYS_CHANNEL9_gp),  /* USART 4 XCK */
    EVSYS_CHANNEL9_USART5_XCK_gc   = (EVSYS_CHANNEL9_USART5_XCK_gv << EVSYS_CHANNEL9_gp),  /* USART 5 XCK */
    EVSYS_CHANNEL9_SPI0_SCK_gc     = (EVSYS_CHANNEL9_SPI0_SCK_gv << EVSYS_CHANNEL9_gp),  /* SPI 0 SCK */
    EVSYS_CHANNEL9_SPI1_SCK_gc     = (EVSYS_CHANNEL9_SPI1_SCK_gv << EVSYS_CHANNEL9_gp),  /* SPI 1 SCK */
    EVSYS_CHANNEL9_TCA0_OVF_LUNF_gc = (EVSYS_CHANNEL9_TCA0_OVF_LUNF_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL9_TCA0_HUNF_gc    = (EVSYS_CHANNEL9_TCA0_HUNF_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL9_TCA0_CMP0_LCMP0_gc = (EVSYS_CHANNEL9_TCA0_CMP0_LCMP0_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL9_TCA0_CMP1_LCMP1_gc = (EVSYS_CHANNEL9_TCA0_CMP1_LCMP1_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL9_TCA0_CMP2_LCMP2_gc = (EVSYS_CHANNEL9_TCA0_CMP2_LCMP2_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL9_TCA1_OVF_LUNF_gc = (EVSYS_CHANNEL9_TCA1_OVF_LUNF_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL9_TCA1_HUNF_gc    = (EVSYS_CHANNEL9_TCA1_HUNF_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL9_TCA1_CMP0_LCMP0_gc = (EVSYS_CHANNEL9_TCA1_CMP0_LCMP0_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL9_TCA1_CMP1_LCMP1_gc = (EVSYS_CHANNEL9_TCA1_CMP1_LCMP1_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL9_TCA1_CMP2_LCMP2_gc = (EVSYS_CHANNEL9_TCA1_CMP2_LCMP2_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL9_TCB0_CAPT_gc    = (EVSYS_CHANNEL9_TCB0_CAPT_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL9_TCB0_OVF_gc     = (EVSYS_CHANNEL9_TCB0_OVF_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL9_TCB1_CAPT_gc    = (EVSYS_CHANNEL9_TCB1_CAPT_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL9_TCB1_OVF_gc     = (EVSYS_CHANNEL9_TCB1_OVF_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL9_TCB2_CAPT_gc    = (EVSYS_CHANNEL9_TCB2_CAPT_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL9_TCB2_OVF_gc     = (EVSYS_CHANNEL9_TCB2_OVF_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL9_TCB3_CAPT_gc    = (EVSYS_CHANNEL9_TCB3_CAPT_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL9_TCB3_OVF_gc     = (EVSYS_CHANNEL9_TCB3_OVF_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL9_TCB4_CAPT_gc    = (EVSYS_CHANNEL9_TCB4_CAPT_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter B4 capture */
    EVSYS_CHANNEL9_TCB4_OVF_gc     = (EVSYS_CHANNEL9_TCB4_OVF_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter B4 overflow */
    EVSYS_CHANNEL9_TCD0_CMPBCLR_gc = (EVSYS_CHANNEL9_TCD0_CMPBCLR_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL9_TCD0_CMPASET_gc = (EVSYS_CHANNEL9_TCD0_CMPASET_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL9_TCD0_CMPBSET_gc = (EVSYS_CHANNEL9_TCD0_CMPBSET_gv << EVSYS_CHANNEL9_gp),  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL9_TCD0_PROGEV_gc  = (EVSYS_CHANNEL9_TCD0_PROGEV_gv << EVSYS_CHANNEL9_gp)   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL9_t;

/* Software event on channel select bit group values */
typedef enum EVSYS_SWEVENTA_VALUES_enum
{
    EVSYS_SWEVENTA_CH0_gv          = 0x01,  /* Software event on channel 0 */
    EVSYS_SWEVENTA_CH1_gv          = 0x02,  /* Software event on channel 1 */
    EVSYS_SWEVENTA_CH2_gv          = 0x04,  /* Software event on channel 2 */
    EVSYS_SWEVENTA_CH3_gv          = 0x08,  /* Software event on channel 3 */
    EVSYS_SWEVENTA_CH4_gv          = 0x10,  /* Software event on channel 4 */
    EVSYS_SWEVENTA_CH5_gv          = 0x20,  /* Software event on channel 5 */
    EVSYS_SWEVENTA_CH6_gv          = 0x40,  /* Software event on channel 6 */
    EVSYS_SWEVENTA_CH7_gv          = 0x80   /* Software event on channel 7 */
} EVSYS_SWEVENTA_values_t;

